{"/about/":{"data":{"":" The website is used as an online repository for Nastran 95 documentation. It was created by the Simulation Software Technology Center of Hexagon Manufacturing Intelligence (Qingdao) Co., Ltd. "},"title":"About"},"/docs/":{"data":{"":"NASTRAN has been released under the NASA Open Source Agreement version 1.3.\nNASTRAN is the NASA Structural Analysis System, a finite element analysis program (FEA) completed in the early 1970’s. It was the first of its kind and opened the door to computer-aided engineering. Subsections of a design can be modeled and then larger groupings of these elements can again be modeled. NASTRAN can handle elastic stability analysis, complex eigenvalues for vibration and dynamic stability analysis, dynamic response for transient and steady state loads, and random excitation, and static response to concentrated and distributed loads, thermal expansion, and enforced deformations.\nNOTE: There is no technical support available for this software."},"title":"Documentation"},"/docs/programmers/":{"data":{"":"NASA SP-223 (01) THENASTRAN PROGRAMMER’S MANUAL SEPTEMBER 1972 Scientific andTechnical Information Office 1972 NATIONAL AERONAUTICS AND SPACE ADMINISTRATION Washington, D.C. II]]1] i,\nForsalefromComputer Software Management andInformation Center (COSMIC) Barrows Hall,University ofGeorgia, Athens, Georgia 30601 -Price $27.50\nPREFACE TOTHENASTRAN PROGRAMMER’S MANIIAL TheProgrammer’s Manual isoneoffourmanuals thatconstitute thedocumentation forNASTRAN, theother three being theTheoretical Manual, theUser’s Manual andtheDemonstration Problem Manual. TheProgrammer’s Manual isdivided intoseven major sections: Section l,NASTRAN Program- ming Fundamentals; Section 2,DataBlock andTable Descriptions; Section 3,Subroutine Descriptions; Section 4,Module Functional Descriptions; Section 5,NASTRAN -Operating System Interfaces; Section 6,Modifications andAdditions toNASTRAN; andSection 7,NASTRAN Support Programs. Section lisageneral overview oftheprogram, andassuchitshould bereadasbackground material forallsections which follow. Section 2contains descriptions ofthedatablocks, which aretheprincipal means ofdata communication between theprogram’s functional modules (amodule isdefined tobeagroup ofsub- routines which perform aspecific function) andtheNASTRAN Executive System. Twoindexes forthe datablock descriptions, onesorted alphabetically ondatablock names andtheother sorted alpha- betically onthenames ofthemodules fromwhich thedatablocks areoutput, aregiven inSections 2.2.1 and2.2.2 respectively. Section 2alsocontains a)descriptions oftables, both coreand noncore resident, maintained bytheNASTRAN Executive System andb)descriptions ofmiscellaneous tables which areaccessed byaclass ofmodules. Alphabetical indexes forthese tables aregiven atthebeginning ofSections 2.4and2.5respectively. Sections 3and4contain descriptions ofthe(utility orgeneral purpose) subroutines and modules ofNASTRAN respectively. Thereader isdirected tothealphabetical indexes, sorted on entry point names, inSections 3.2and4.1.3 respectively forthese sections. Anindex tothe Module Functional Descriptions, sorted alphabetically onmodule names, isgiven inSection 4.1.2. Thereader isurged toreadtheintroductory material toSections 3and4before using these sections. Section 5treats computer andoperating system dependent matters suchasoperating system control cards andgeneration oftheabsolute (executable) NASTRAN system. Section 6describes themeans bywhich modifications andadditions toNASTRAN areimplemented. Section 7describes several auxiliary programs usedtomaintain orinterface withNASTRAN. Thelearning ofanynewsystem, whether itbeanoperating system oralarge applications system likeNASTRA_I, ismademoredifficult thanitought tobebecause oftheusebythedesigners ofthesystem ofnewmnemonics, acronyms, phrases and\"buzz\" words. Inorder toaidthereader in i(811172)\nlearning suchcommonly usedNASTRAN terms, asingle source reference, Section 7,theNASTRAN Dictionary, oftheUser’s Manual isprovided. Theprogrammer isadivsed tosecure acopyofat leastthissection oftheUser’s Manual forhisday-to-day reference. ii(8/I/72)"},"title":"Programmer's Manual"},"/docs/summary/":{"data":{"":"This section includes two parts. The first part is a summary of the main concepts and tools used in this\nNASTRAN Programmers Manual NASTRAN Users Manual 2 "},"title":"A Summary"},"/docs/users/":{"data":{"":"NASASP-222(08) VOLUME II NASTRAN@ USER’S MANUAL JUNE 1986 runm\nNASASP-222(08) Volume 11 NASTRAN USER’S MANUAL June1986\nForsalefromComputer Software Management andInformation Center(COSMIC) Computer Services Annex,University ofGeorgia, Athens, Georgia 30602 ‘ ●\nCOSMIC TheUniversity ofGeorgia Computer Services Annex Athens, GA30602 (404) 542-3265 NASTWN USER MANUAL UPDATE NOTE TheNASTRAN User Manual isscheduled forreview each year todetermine whether updates are required. Toaddyour name tothedatabase to receive notification when updates areavailable, youwill need tocomplete this form andreturn to COSMIC .This will betheonly mailing list for keeping users informed about themanual updates. Your Name: Company: Mailing Address: City: State: Zip: June, 1986 Fold, staple, and return this form asaself-mailer.\nII BUSINESS REPLYMAIL 1FIRSTCLASS PERMITNO,559 ATHENS, CiEORGIA I F’OSTAGE WILLBEPAIDBYADDRESSES COSMIC TheUniversity ofGeorgia Computer Services Annex Athens, GA30602NOPOSTAGE NECESSARY IFMAILED INTHE UNITEDSTATES\nINTRODUCTION TheUser’sManualisoneoffourmanuals thatconstitute thedocumentation forNASTRAN, the otherthreebeingtheTheoretical Manual, theProgrammer’s ManualandtheDemonstration Problem Manual.Although theUser’sManualcontains alloftheinformation thatisdirectly associated withthesolution ofproblems withNASTRAN, theuserwillfinditdesirable torefertotheother manuals forassistance inthesolution ofspecific userproblems. TheTheoretical Manualgivesanexcellent introduction toNASTRAN andpresents developments of theanalytical andnumerical procedures thatunderlie theprogram. TheUser’sManual is instructive andencyclopedic innature, butisrestricted tothoseitemsrelated totheuseof NASTRAN thataregenerally independent ofthecomputing systembeingused.Computer-dependent topicsandinformation thatisrequired forthemaintenance andmodification oftheprogram are treated intheProgrammer’s Manual. TheProgrammer’s Manualalsoprovides acomplete description oftheprogram, including themathematical equations implemented inthecode.TheDemonstration Problem Manualpresents adiscussion ofthesampleproblems delivered w!thNASTRAN, thereby illustrating theformulation ofthedifferent typesofprob’!ems thatcanbsolvedwithNASH?PN. Inaddition tothefourmanual described above,thereisalsoaNASTRAN User’sGuidethat servesasahandbook forusers. Itdescribes alloftheNASTRAN features andoptions and illustrates thembyexamples. Otherexcellent sources forNASTRAN-related topicsarethe proceedings oftheNASTRAN Users’Colloquia (heldnormally everyyear)whichprovide alargebody ofinformation basedonuserexperiences withNASTRAN. TheUser’sManualhasrecently beencompletely revised andupdated. Withaviewtofacilitate easierupdating ofthemanualinthefuturetokeepupwithnewerreleases ofNASTRAN, ithasnow beendivided intotwovolumes. VolumeIconsists ofsevensections dIldcontains allofthematerial thatwasintheold singlevolume, exceptSection 3.Thissection hasbeenre-arranged intofoursections andforms VolumeII.Inordertoavoidconfusion, Section 3ofVolumeIdoesnotcontain anything otherthan areference tothenewVolumeII.Also,itshouldbenotedherethat,unlessexplicitly indicated otherwise, allreferences tosections ineachvolumereferonl ——..—.—-—.. —….—.–………——..ytosections inthatvolume,—.——.—— —— ..——. . NASTRAN usesthefiniteelement approach tostructural modeling, wherein thedistributed physical properties ofastructure arerepresented byafinitenumberofstructural elements which areinterconnected atafinitenumberofgridpoints, towhichloadsareapplied andforwhich displacements are’calculated. Theprocedures fordefining andloading astructural modelare i(05/30/86)\ndescribed inVolumeI,Section 1.Thissection contains afunctional reference foreverycardthat isusedforstructural modeling. TheNASTRAN DataDeck,including thedetails foreachofthedatacards,isdescribed in VolumeI,Section 2.Thissection alsodiscusses theNASTRAN control cardsthatareassociated withtheuseoftheprogram. Asmentioned earlier, VolumeI,Section 3doesnotcontain anything otherthanareference to VolumeII. Theprocedures forusingtheNASTRAN plotting capability aredescribed inVolumeI,Section 4. Bothdeformed andundeformed plotsofthestructural modelareavailable. Response curvesarealso available forstatic, transient response, frequency response, modalflutter andmodalaeroelastic response analyses. NASTRAN contains problem solution sequences, calledrigidformats, Eachoftheserigid formats isassociated withthesolution ofproblems foraparticular typeofstaticordynamic analysis. inaddition totherigidformatprocedures, theusermaychoosetowritehisownDirect Abstraction Program (DMAP), Thisprocedure permits theusertoexecute aseriesofmatrix operations ofhischoicealongwithanyutility modules orexecutive operations thathemayneed. Therulesgoverning thecreation ofDMAPprograms aredescribed inVolumeI,Section 5. TheNASTRAN diagnostic messages aredocumented andexplained inVolumeI,Section 6.The NASTRAN Dictionary, inVolumeI,Section 7,contains descriptions ofmnemonics, acronyms, phrases, andothercommonly usedNASTRAN terms. VolumeII,Section 1contains ageneral description ofrigidformatprocedures. Specific instructions andinformation fortheuseofeachrigidformataregiveninVolumeII,Sections 2,3 and4,whichdealwiththerigidformats associated withtheDISPLACEMENT, HEATandAERO approaches, respectively. Thereisalimited numberofsampleproblems included intheUser’sManual. However, amore comprehensive setofdemonstration problems, atleastoneforeachoftherigidformats, is described intheNASTRAN Demonstration Problem Manual, Thedatadecksareavailable ontapefor eachofthecomputer systems onwhichNASTRAN hasbeenimplemented. Samples oftheprinter output andofstructure plotsandresponse plotscanbeobtained byexecuting thesedemonstration problems. Theprinter outputfortheseproblems isalsoavailable onmicrofiche. ii(05/30/86)Matrix @ I"},"title":"User's Manual"}}